g4klx/MMDVM/STM32F7XX_Lib/STM32F7xx_StdPeriph_Driver/inc/stm32f7xx_usart.h
#define IS_USART_CLEAR_FLAG(FLAG) (((FLAG) == USART_FLAG_WU) || ((FLAG) == USART_FLAG_TC) || \
                                   ((FLAG) == USART_FLAG_IDLE) || ((FLAG) == USART_FLAG_ORE) || \
                                   ((FLAG) == USART_FLAG_NE) || ((FLAG) == USART_FLAG_FE) || \
                                   ((FLAG) == USART_FLAG_LBD) || ((FLAG) == USART_FLAG_CTS) || \
                                   ((FLAG) == USART_FLAG_RTO) || ((FLAG) == USART_FLAG_EOB) || \
                                   ((FLAG) == USART_FLAG_CM) || ((FLAG) == USART_FLAG_PE))
/**
  * @}
  */ 

/** @defgroup USART_Interrupt_definition 
  * @brief USART Interrupt definition
  * USART_IT possible values
  * Elements values convention: 0xZZZZYYXX
  *   XX: Position of the corresponding Interrupt
  *   YY: Register index
  *   ZZZZ: Flag position
  * @{
  */

#define USART_IT_WU                          ((uint32_t)0x00140316)
#define USART_IT_CM                          ((uint32_t)0x0011010E)
#define USART_IT_EOB                         ((uint32_t)0x000C011B)
#define USART_IT_RTO                         ((uint32_t)0x000B011A)
#define USART_IT_PE                          ((uint32_t)0x00000108)
#define USART_IT_TXE                         ((uint32_t)0x00070107)
#define USART_IT_TC                          ((uint32_t)0x00060106)
#define USART_IT_RXNE                        ((uint32_t)0x00050105)
#define USART_IT_IDLE                        ((uint32_t)0x00040104)
#define USART_IT_LBD                         ((uint32_t)0x00080206)
#define USART_IT_CTS                         ((uint32_t)0x0009030A) 
#define USART_IT_ERR                         ((uint32_t)0x00000300)
#define USART_IT_ORE                         ((uint32_t)0x00030300)
#define USART_IT_NE                          ((uint32_t)0x00020300)
#define USART_IT_FE                          ((uint32_t)0x00010300)

#define IS_USART_CONFIG_IT(IT) (((IT) == USART_IT_PE) || ((IT) == USART_IT_TXE) || \
                                ((IT) == USART_IT_TC) || ((IT) == USART_IT_RXNE) || \
                                ((IT) == USART_IT_IDLE) || ((IT) == USART_IT_LBD) || \
                                ((IT) == USART_IT_CTS) || ((IT) == USART_IT_ERR) || \
                                ((IT) == USART_IT_RTO) || ((IT) == USART_IT_EOB) || \
                                ((IT) == USART_IT_CM) || ((IT) == USART_IT_WU))

#define IS_USART_GET_IT(IT) (((IT) == USART_IT_PE) || ((IT) == USART_IT_TXE) || \
                             ((IT) == USART_IT_TC) || ((IT) == USART_IT_RXNE) || \
                             ((IT) == USART_IT_IDLE) || ((IT) == USART_IT_LBD) || \
                             ((IT) == USART_IT_CTS) || ((IT) == USART_IT_ORE) || \
                             ((IT) == USART_IT_NE) || ((IT) == USART_IT_FE) || \
                             ((IT) == USART_IT_RTO) || ((IT) == USART_IT_EOB) || \
                             ((IT) == USART_IT_CM) || ((IT) == USART_IT_WU))

#define IS_USART_CLEAR_IT(IT) (((IT) == USART_IT_TC) || ((IT) == USART_IT_PE) || \
                               ((IT) == USART_IT_FE) || ((IT) == USART_IT_NE) || \
                               ((IT) == USART_IT_ORE) || ((IT) == USART_IT_IDLE) || \
                               ((IT) == USART_IT_LBD) || ((IT) == USART_IT_CTS) || \
                               ((IT) == USART_IT_RTO) || ((IT) == USART_IT_EOB) || \
                               ((IT) == USART_IT_CM) || ((IT) == USART_IT_WU))
/**
  * @}
  */
    
#define IS_USART1_CLKSOURCE_PCLK2()     ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART1SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART1SEL_0 ))
#define IS_USART1_CLKSOURCE_SYSCLK()    ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART1SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART1SEL_0 ))
#define IS_USART1_CLKSOURCE_HSI()       ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART1SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART1SEL_0 ))
#define IS_USART1_CLKSOURCE_LSE()       ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART1SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART1SEL_0 ))

#define IS_USART2_CLKSOURCE_PCLK1()     ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART2SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART2SEL_0 ))
#define IS_USART2_CLKSOURCE_SYSCLK()    ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART2SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART2SEL_0 ))
#define IS_USART2_CLKSOURCE_HSI()       ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART2SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART2SEL_0 ))
#define IS_USART2_CLKSOURCE_LSE()       ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART2SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART2SEL_0 ))

#define IS_USART3_CLKSOURCE_PCLK1()     ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART3SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART3SEL_0 ))
#define IS_USART3_CLKSOURCE_SYSCLK()    ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART3SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART3SEL_0 ))
#define IS_USART3_CLKSOURCE_HSI()       ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART3SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART3SEL_0 ))
#define IS_USART3_CLKSOURCE_LSE()       ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART3SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART3SEL_0 ))

#define IS_UART4_CLKSOURCE_PCLK1()      ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART4SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART4SEL_0 ))
#define IS_UART4_CLKSOURCE_SYSCLK()     ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART4SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART4SEL_0 ))
#define IS_UART4_CLKSOURCE_HSI()        ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART4SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART4SEL_0 ))
#define IS_UART4_CLKSOURCE_LSE()        ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART4SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART4SEL_0 ))

#define IS_UART5_CLKSOURCE_PCLK1()      ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART5SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART5SEL_0 ))
#define IS_UART5_CLKSOURCE_SYSCLK()     ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART5SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART5SEL_0 ))
#define IS_UART5_CLKSOURCE_HSI()        ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART5SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART5SEL_0 ))
#define IS_UART5_CLKSOURCE_LSE()        ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART5SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART5SEL_0 ))

#define IS_USART6_CLKSOURCE_PCLK2()     ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART6SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART6SEL_0 ))
#define IS_USART6_CLKSOURCE_SYSCLK()    ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART6SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART6SEL_0 ))
#define IS_USART6_CLKSOURCE_HSI()       ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART6SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART6SEL_0 ))
#define IS_USART6_CLKSOURCE_LSE()       ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART6SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_USART6SEL_0 ))

#define IS_UART7_CLKSOURCE_PCLK1()      ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART7SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART7SEL_0 ))
#define IS_UART7_CLKSOURCE_SYSCLK()     ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART7SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART7SEL_0 ))
#define IS_UART7_CLKSOURCE_HSI()        ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART7SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART7SEL_0 ))
#define IS_UART7_CLKSOURCE_LSE()        ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART7SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART7SEL_0 ))

#define IS_UART8_CLKSOURCE_PCLK1()      ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART8SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART8SEL_0 ))
#define IS_UART8_CLKSOURCE_SYSCLK()     ( !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART8SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART8SEL_0 ))
#define IS_UART8_CLKSOURCE_HSI()        ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART8SEL_1 ) && !( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART8SEL_0 ))
#define IS_UART8_CLKSOURCE_LSE()        ( ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART8SEL_1 ) && ( RCC->DCKCFGR2 & RCC_DCKCFGR2_UART8SEL_0 ))

#define IS_USART_BAUDRATE(__BAUDRATE__) ((__BAUDRATE__) < 9000001)
#define IS_USART_DE_ASSERTION_DEASSERTION_TIME(TIME) ((TIME) <= 0x1F)
#define IS_USART_AUTO_RETRY_COUNTER(COUNTER) ((COUNTER) <= 0x7)
#define IS_USART_TIMEOUT(TIMEOUT) ((TIMEOUT) <= 0x00FFFFFF)
#define IS_USART_DATA(DATA) ((DATA) <= USART_TDR_TDR)




/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */

